examples/perl/templates/soap_image.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pid="http://pid.socialhistoryservices.org/">
<soapenv:Body>
     <pid:CreatePidRequest>
	<pid:na>%%org%%</pid:na>
	<pid:handle>      
	 	<pid:pid>%%org%%/%%barcode%%</pid:pid>
		<pid:resolveUrl>%%url%%</pid:resolveUrl>
        </pid:handle>
      </pid:CreatePidRequest>
</soapenv:Body>
</soapenv:Envelope>
